DataProcessors/А_ОбработкаНеизвестногоПартнера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>А_ОбработкаНеизвестногоПартнера</Name>
			<Comment>Поиск и замена ссылок на НеизвестныйПартнер в документах</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИерархияПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИерархияПартнеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АналитикаУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АналитикаУчетаПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПартий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КомпанияЧастноеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>КомпанияЧастноеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Comment>Используется для группировки по территориальному признаку</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиенты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Публичное наименование, например, для печати или устного обращения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Comment>Конкуренты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<Comment>Обслуживаются торговыми представителями</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Comment>Перевозчики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/А_ОбработкаНеизвестногоПартнера/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАМЕНЫ "НЕИЗВЕСТНОГО ПАРТНЁРА" — v3.0
// UX в стиле "СинхронизироватьДеньгиКасса": сводка, цветные статусы, master-detail,
// "Проанализировать" / "Заменить всё" (с подтверждением) / "Действие по строке".
//
// Движок (самодостаточный, без зависимости от загрузки конфигурации):
//  - НайтиПоСсылкам([Неизвестный]) — находит ВСЕ ссылки (включая ключи аналитики и регистры);
//  - резолв реального партнёра по контрагенту (приоритеты: текущий/головной/тёзка/ЕДРПОУ/создать);
//  - замена прямых полей (контрагент/договоры/документы/независимые РС);
//  - СВЁРТКА ключевых сущностей (ОбъектыРасчетов, КлючиАналитики*) через
//    ОбщегоНазначения.ЗаменитьСсылки + пометка дублей на удаление;
//  - БЕЗ перепроведения (замена рефов/атрибутов суммы не меняет).
// Проверено на боевой базе (контрагент "ФОП Чміль І.М", свёртка 12 дубль-ключей).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НеизвестныйПартнер = Справочники.Партнеры.НеизвестныйПартнер;
	Элементы.НадписьРезюме.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	НастроитьУсловноеОформление();
	ОбновитьРезюме();
КонецПроцедуры

&НаСервере
Процедура НастроитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// Обработанные строки контрагентов — серым
	Элемент = УсловноеОформление.Элементы.Добавить();
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентовФорма");
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентов.Статус");
	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.НачинаетсяС;
	Отбор.ПравоеЗначение = "Обработан";
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);

	// Ошибки — красным
	Элемент = УсловноеОформление.Элементы.Добавить();
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентовФорма");
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентов.Статус");
	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.НачинаетсяС;
	Отбор.ПравоеЗначение = "ОШИБКА";
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);

	// "Будет создан партнёр" — выделить
	Элемент = УсловноеОформление.Элементы.Добавить();
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентовФормаСоздавать");
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентов.Создавать");
	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Синий);

КонецПроцедуры

&НаСервере
Процедура ОбновитьРезюме()

	КолК = ТаблицаКонтрагентов.Количество();
	КолСсылок = 0;
	КолСоздать = 0;
	КолОбработано = 0;
	Для Каждого Стр Из ТаблицаКонтрагентов Цикл
		КолСсылок = КолСсылок + Стр.КолвоСсылок;
		Если Стр.Создавать Тогда
			КолСоздать = КолСоздать + 1;
		КонецЕсли;
		Если СтрНачинаетсяС(Стр.Статус, "Обработан") Тогда
			КолОбработано = КолОбработано + 1;
		КонецЕсли;
	КонецЦикла;

	Если КолК = 0 Тогда
		НадписьРезюме = "Натисніть «Проаналізувати» — пошук усіх посилань на «Неизвестный партнер»";
	Иначе
		НадписьРезюме = "Контрагентів: " + КолК
			+ " | посилань: " + КолСсылок
			+ " | створити партнерів: " + КолСоздать
			+ " | оброблено: " + КолОбработано;
	КонецЕсли;

	Элементы.ТаблицаКонтрагентовФорма.Заголовок =
		"Контрагенти з «Неизвестный партнер»" + ?(КолК > 0, " (" + КолК + ")", "");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Проанализировать(Команда)
	Итог = ПроанализироватьНаСервере();
	ПрименитьФильтрОбъектов();
	ПоказатьПредупреждение(, Итог);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВсе(Команда)
	Если ТаблицаКонтрагентов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Спочатку «Проаналізувати»!");
		Возврат;
	КонецЕсли;
	Оп = Новый ОписаниеОповещения("ЗаменитьВсеЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оп,
		"Замінити «Неизвестный партнер» у " + ТаблицаКонтрагентов.Количество() + " контрагентів?"
		+ Символы.ПС + "Дублі ключів/об'єктів розрахунків будуть згорнуті та позначені на видалення."
		+ Символы.ПС + "Рекомендується резервна копія бази.",
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВсеЗавершение(Результат, ДопПарам) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Итог = ЗаменитьВсеНаСервере();
		ПрименитьФильтрОбъектов();
		ПоказатьПредупреждение(, Итог);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПоСтроке(Команда)
	ТекДанные = Элементы.ТаблицаКонтрагентовФорма.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Встаньте на рядок контрагента!");
		Возврат;
	КонецЕсли;
	Итог = ЗаменитьСтрокуНаСервере(ТаблицаКонтрагентов.Индекс(ТекДанные));
	ПрименитьФильтрОбъектов();
	ПоказатьПредупреждение(, Итог);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовФормаПриАктивизацииСтроки(Элемент)
	ПрименитьФильтрОбъектов();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтрОбъектов()
	ТекДанные = Элементы.ТаблицаКонтрагентовФорма.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Элементы.ТаблицаОбъектовФорма.ОтборСтрок = Неопределено;
	Иначе
		Элементы.ТаблицаОбъектовФорма.ОтборСтрок =
			Новый ФиксированнаяСтруктура(Новый Структура("Контрагент", ТекДанные.Контрагент));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Анализ

&НаСервере
Функция ПроанализироватьНаСервере()

	ТаблицаКонтрагентов.Очистить();
	ТаблицаОбъектов.Очистить();

	Неизв = Справочники.Партнеры.НеизвестныйПартнер;
	НеизвестныйПартнер = Неизв;

	Массив = Новый Массив;
	Массив.Добавить(Неизв);
	Источники = НайтиПоСсылкам(Массив);

	СлужебныхСсылок = 0; // навигационные/служебные регистры — партнёр не выводится

	// группировка источников по контрагенту-контексту
	КартаКонтр = Новый Соответствие; // Контрагент(ссылка) -> Структура(Контрагент, КолвоСсылок)
	Для Каждого СтрИст Из Источники Цикл
		ИмяМД = СтрИст.Метаданные.ПолноеИмя();

		// Пропустить помеченные на удаление (уйдут штатной «Удаление помеченных объектов»)
		Попытка
			Если СтрИст.Данные.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
		Исключение
		КонецПопытки;

		// Навигационный реестр и иерархия партнёра-заглушки — не учётные, контрагент не выводится
		Если ИмяМД = "РегистрСведений.РеестрДокументов" ИЛИ ИмяМД = "РегистрСведений.ИерархияПартнеров" Тогда
			СлужебныхСсылок = СлужебныхСсылок + 1;
			Продолжить;
		КонецЕсли;

		Контрагент = ОпределитьКонтрагентаКонтекста(СтрИст.Данные, ИмяМД);

		// строка детализации объектов
		НоваяОб = ТаблицаОбъектов.Добавить();
		Попытка
			НоваяОб.Объект = СтрИст.Данные; // для записей независимых РС Данные может быть не-ссылкой
		Исключение
		КонецПопытки;
		НоваяОб.ТипОбъекта = ИмяМД;
		НоваяОб.Контрагент = Контрагент;
		НоваяОб.Статус = "знайдено";

		Если ЗначениеЗаполнено(Контрагент) Тогда
			Данные = КартаКонтр.Получить(Контрагент);
			Если Данные = Неопределено Тогда
				Данные = Новый Структура("КолвоСсылок", 0);
				КартаКонтр.Вставить(Контрагент, Данные);
			КонецЕсли;
			Данные.КолвоСсылок = Данные.КолвоСсылок + 1;
		КонецЕсли;
	КонецЦикла;

	// заполнить таблицу контрагентов + целевой партнёр (резолв без создания на этом шаге)
	Для Каждого КЗ Из КартаКонтр Цикл
		Контрагент = КЗ.Ключ;
		Стр = ТаблицаКонтрагентов.Добавить();
		Стр.Контрагент = Контрагент;
		Стр.КолвоСсылок = КЗ.Значение.КолвоСсылок;
		ЦелевойБезСоздания = ОбеспечитьРеальногоПартнераПоКонтрагенту(Контрагент, Ложь);
		Если ЗначениеЗаполнено(ЦелевойБезСоздания) Тогда
			Стр.ЦелевойПартнер = ЦелевойБезСоздания;
			Стр.Создавать = Ложь;
			Стр.Статус = "готовий → " + ЦелевойБезСоздания;
		Иначе
			Стр.Создавать = Истина;
			Стр.Статус = "буде створено партнера «" + Контрагент + "»";
		КонецЕсли;
	КонецЦикла;

	ТаблицаКонтрагентов.Сортировать("КолвоСсылок Убыв");
	ОбновитьРезюме();
	Итог = "Контрагентів до заміни: " + ТаблицаКонтрагентов.Количество();
	Если СлужебныхСсылок > 0 Тогда
		Итог = Итог + Символы.ПС + "Службових посилань (РеестрДокументов/ІерархіяПартнерів) — " + СлужебныхСсылок
			+ ": не замінюються (не впливають на облік, чистяться перепроведенням/видаленням).";
	КонецЕсли;
	Возврат Итог;

КонецФункции

// Определяет контрагента-владельца для найденного источника.
&НаСервере
Функция ОпределитьКонтрагентаКонтекста(Данные, ИмяМД)
	Если ИмяМД = "Справочник.Контрагенты" Тогда
		Возврат Данные;
	КонецЕсли;
	Попытка
		Контр = Данные.Контрагент;
		Если ТипЗнч(Контр) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Контр) Тогда
			Возврат Контр;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область Замена

&НаСервере
Функция ЗаменитьВсеНаСервере()
	Возврат ВыполнитьЗаменуНаСервере(-1);
КонецФункции

&НаСервере
Функция ВыполнитьЗаменуНаСервере(ИндексСтроки)

	Неизв = Справочники.Партнеры.НеизвестныйПартнер;
	ОбработаноКонтр = 0;
	ОшибокКонтр = 0;

	Для Каждого Стр Из ТаблицаКонтрагентов Цикл
		Если ИндексСтроки >= 0 И ТаблицаКонтрагентов.Индекс(Стр) <> ИндексСтроки Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНачинаетсяС(Стр.Статус, "Обработан") Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			Цель = ОбеспечитьРеальногоПартнераПоКонтрагенту(Стр.Контрагент, Истина);
			Стр.ЦелевойПартнер = Цель;
			Стр.Создавать = Ложь;
			ОбработатьКонтрагента(Стр.Контрагент, Цель, Неизв);
			Остаток = ОстатокПоКонтрагенту(Стр.Контрагент, Неизв);
			Если Остаток = 0 Тогда
				Стр.Статус = "Обработан → " + Цель;
				ОбработаноКонтр = ОбработаноКонтр + 1;
			Иначе
				Стр.Статус = "ОШИБКА: лишилось посилань " + Остаток;
				ОшибокКонтр = ОшибокКонтр + 1;
			КонецЕсли;
		Исключение
			Стр.Статус = "ОШИБКА: " + ОписаниеОшибки();
			ОшибокКонтр = ОшибокКонтр + 1;
		КонецПопытки;
	КонецЦикла;

	ОбновитьРезюме();
	Возврат "Оброблено контрагентів: " + ОбработаноКонтр + ?(ОшибокКонтр > 0, ", помилок: " + ОшибокКонтр, "");

КонецФункции

&НаСервере
Функция ЗаменитьСтрокуНаСервере(ИндексСтроки)
	Возврат ВыполнитьЗаменуНаСервере(ИндексСтроки);
КонецФункции

// Полный каскад замены для одного контрагента (порт проверенной Python-логики).
&НаСервере
Процедура ОбработатьКонтрагента(Контрагент, Цель, Неизв)

	// 1. Контрагент.Партнер
	КонтрОбъект = Контрагент.ПолучитьОбъект();
	Если КонтрОбъект.Партнер = Неизв ИЛИ НЕ ЗначениеЗаполнено(КонтрОбъект.Партнер) Тогда
		КонтрОбъект.Партнер = Цель;
		ЗаписатьЗагрузкой(КонтрОбъект);
	КонецЕсли;

	// 2. Договоры контрагента
	Для Каждого ДогСсылка Из ВыбратьСсылки("Справочник.ДоговорыКонтрагентов", "Контрагент", Контрагент, "Партнер", Неизв) Цикл
		ДогОбъект = ДогСсылка.ПолучитьОбъект();
		ДогОбъект.Партнер = Цель;
		ЗаписатьЗагрузкой(ДогОбъект);
	КонецЦикла;

	// 3. Ключи аналитики по партнёрам (свёртка/на месте) — поле Партнер
	СвернутьКлючи("Справочник.КлючиАналитикиУчетаПоПартнерам", "Партнер", Контрагент, Цель, Неизв,
		"Организация,Контрагент,Договор,НаправлениеДеятельности");

	// 4. Ключи аналитики учёта партий — поле Поставщик
	СвернутьКлючи("Справочник.КлючиАналитикиУчетаПартий", "Поставщик", Контрагент, Цель, Неизв,
		"ГруппаФинансовогоУчета,Контрагент,НалоговоеНазначение,СтавкаНДС,ВидЦенности,КодСтроки");

	// 5. Объекты расчётов (свёртка через серверные функции поиска эталона)
	СвернутьОбъектыРасчетов(Контрагент, Цель, Неизв);

	// 6. Кэш АналитикаУчетаПоПартнерам (Партнер — ИЗМЕРЕНИЕ -> перезапись записи)
	ПеренестиКэшАналитики(Контрагент, Цель, Неизв);

	// 7. Кэш АналитикаУчетаПартий (Поставщик — ИЗМЕРЕНИЕ -> перезапись записи)
	ПеренестиКэшПартий(Контрагент, Цель, Неизв);

	// 8. Документы: поле Партнер в шапке и в ТЧ (по контексту контрагента)
	ОбработатьДокументы(Контрагент, Цель, Неизв);

	// 9. Удалить освобождённые дубли (ключи/ОР): после фикса кэша на канонический ключ
	//    помеченные дубли уже без ссылок -> физически удаляем (свёртка дублей доводится до конца).
	УдалитьОсвобождённыеДубли(Контрагент, Неизв);

КонецПроцедуры

// Удаляет помеченные дубли (ключи аналитики, ОбъектыРасчётов), у которых уже 0 ссылок.
// Те, что ещё держатся ссылкой (напр. помеченными документами) — остаются помеченными
// (уйдут штатной «Удаление помеченных объектов» вместе с этими документами).
&НаСервере
Процедура УдалитьОсвобождённыеДубли(Контрагент, Неизв)

	Перечень = Новый Массив;
	Перечень.Добавить("Справочник.КлючиАналитикиУчетаПоПартнерам|Партнер");
	Перечень.Добавить("Справочник.КлючиАналитикиУчетаПартий|Поставщик");
	Перечень.Добавить("Справочник.ОбъектыРасчетов|Партнер");

	Для Каждого ТП Из Перечень Цикл
		Части = СтрРазделить(ТП, "|");
		ИмяТаблицы = Части[0];
		Поле = Части[1];
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка ИЗ " + ИмяТаблицы + " КАК Т ГДЕ Т.Контрагент = &К И Т."
			+ Поле + " = &P И Т.ПометкаУдаления";
		Запрос.УстановитьПараметр("К", Контрагент);
		Запрос.УстановитьПараметр("P", Неизв);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			Масс = Новый Массив;
			Масс.Добавить(Выб.Ссылка);
			Если НайтиПоСсылкам(Масс).Количество() = 0 Тогда
				Попытка
					Выб.Ссылка.ПолучитьОбъект().Удалить();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Свёртка ключевых справочников: если эталон с Цель и теми же измерениями есть -> ЗаменитьСсылки+пометка,
// иначе правка поля партнёра на месте.
&НаСервере
Процедура СвернутьКлючи(ИмяТаблицы, ПолеПартнера, Контрагент, Цель, Неизв, СписокИзмерений)

	Для Каждого КлючСсылка Из ВыбратьСсылки(ИмяТаблицы, "Контрагент", Контрагент, ПолеПартнера, Неизв) Цикл
		Эталон = НайтиЭталонКлюча(ИмяТаблицы, ПолеПартнера, КлючСсылка, Цель, СписокИзмерений);
		Если ЗначениеЗаполнено(Эталон) И Эталон <> КлючСсылка Тогда
			ЗаменитьИПометить(КлючСсылка, Эталон);
		Иначе
			Объ = КлючСсылка.ПолучитьОбъект();
			Объ[ПолеПартнера] = Цель;
			ЗаписатьЗагрузкой(Объ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция НайтиЭталонКлюча(ИмяТаблицы, ПолеПартнера, КлючСсылка, Цель, СписокИзмерений)

	Условия = Новый Массив;
	Условия.Добавить("Т." + ПолеПартнера + " = &Цель");
	Условия.Добавить("Т.Ссылка <> &Сам");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Цель", Цель);
	Запрос.УстановитьПараметр("Сам", КлючСсылка);
	Для Каждого Изм Из СтрРазделить(СписокИзмерений, ",") Цикл
		ИмяИзм = СокрЛП(Изм);
		Условия.Добавить("Т." + ИмяИзм + " = &П_" + ИмяИзм);
		Запрос.УстановитьПараметр("П_" + ИмяИзм, КлючСсылка[ИмяИзм]);
	КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Т.Ссылка КАК Ссылка ИЗ " + ИмяТаблицы + " КАК Т ГДЕ "
		+ СтрСоединить(Условия, " И ");
	Выб = Запрос.Выполнить().Выбрать();
	Возврат ?(Выб.Следующий(), Выб.Ссылка, Неопределено);

КонецФункции

// Канонический НЕпомеченный ключ для (Цель, заданные измерения). ИзмеренияСтруктура: Имя -> Значение.
&НаСервере
Функция НайтиКлючПоИзмерениям(ИмяТаблицы, ПолеПартнера, Цель, ИзмеренияСтруктура)
	Условия = Новый Массив;
	Условия.Добавить("Т." + ПолеПартнера + " = &Цель");
	Условия.Добавить("НЕ Т.ПометкаУдаления");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Цель", Цель);
	Для Каждого КЗ Из ИзмеренияСтруктура Цикл
		Условия.Добавить("Т." + КЗ.Ключ + " = &П_" + КЗ.Ключ);
		Запрос.УстановитьПараметр("П_" + КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Т.Ссылка КАК Ссылка ИЗ " + ИмяТаблицы + " КАК Т ГДЕ "
		+ СтрСоединить(Условия, " И ");
	Выб = Запрос.Выполнить().Выбрать();
	Возврат ?(Выб.Следующий(), Выб.Ссылка, Неопределено);
КонецФункции

&НаСервере
Процедура СвернутьОбъектыРасчетов(Контрагент, Цель, Неизв)

	Для Каждого ОРСсылка Из ВыбратьСсылки("Справочник.ОбъектыРасчетов", "Контрагент", Контрагент, "Партнер", Неизв) Цикл
		О = ОРСсылка;
		Эталон = Неопределено;
		Если ЗначениеЗаполнено(О.Объект) Тогда
			Парам = Новый Структура;
			Парам.Вставить("Объект", О.Объект);
			Парам.Вставить("Организация", О.Организация);
			Парам.Вставить("Контрагент", О.Контрагент);
			Парам.Вставить("Партнер", Цель);
			Парам.Вставить("ТипРасчетов", О.ТипРасчетов);
			Эталон = ОбъектыРасчетовСервер.НайтиНовыйОбъектРасчетов(Парам);
		Иначе
			Парам = ОбъектыРасчетовСервер.ПолучитьПараметрыОбъектаРасчетов();
			Парам.Организация = О.Организация;
			Парам.Партнер = Цель;
			Парам.Контрагент = О.Контрагент;
			Парам.Договор = О.Договор;
			Парам.НаправлениеДеятельности = О.НаправлениеДеятельности;
			Парам.ТипРасчетов = О.ТипРасчетов;
			Эталон = ОбъектыРасчетовСервер.НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(Парам);
		КонецЕсли;

		Если ЗначениеЗаполнено(Эталон) И Эталон <> ОРСсылка Тогда
			ЗаменитьИПометить(ОРСсылка, Эталон);
		Иначе
			Объ = ОРСсылка.ПолучитьОбъект();
			Объ.Партнер = Цель;
			ЗаписатьЗагрузкой(Объ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПеренестиКэшАналитики(Контрагент, Цель, Неизв)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ Организация, Контрагент, Договор, НаправлениеДеятельности, КлючАналитики
	|ИЗ РегистрСведений.АналитикаУчетаПоПартнерам
	|ГДЕ Контрагент = &К И Партнер = &P";
	Запрос.УстановитьПараметр("К", Контрагент);
	Запрос.УстановитьПараметр("P", Неизв);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		// КлючАналитики -> канонический ключ (с реальным партнёром), иначе старый освободить нельзя
		Изм = Новый Структура("Организация,Контрагент,Договор,НаправлениеДеятельности",
			Выб.Организация, Выб.Контрагент, Выб.Договор, Выб.НаправлениеДеятельности);
		КанонКлюч = НайтиКлючПоИзмерениям("Справочник.КлючиАналитикиУчетаПоПартнерам", "Партнер", Цель, Изм);
		Если НЕ ЗначениеЗаполнено(КанонКлюч) Тогда
			КанонКлюч = Выб.КлючАналитики;
		КонецЕсли;

		Нов = РегистрыСведений.АналитикаУчетаПоПартнерам.СоздатьМенеджерЗаписи();
		Нов.Партнер = Цель;
		Нов.Организация = Выб.Организация;
		Нов.Контрагент = Выб.Контрагент;
		Нов.Договор = Выб.Договор;
		Нов.НаправлениеДеятельности = Выб.НаправлениеДеятельности;
		Нов.КлючАналитики = КанонКлюч;
		Нов.Записать();

		Стар = РегистрыСведений.АналитикаУчетаПоПартнерам.СоздатьМенеджерЗаписи();
		Стар.Партнер = Неизв;
		Стар.Организация = Выб.Организация;
		Стар.Контрагент = Выб.Контрагент;
		Стар.Договор = Выб.Договор;
		Стар.НаправлениеДеятельности = Выб.НаправлениеДеятельности;
		Стар.Удалить();
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПеренестиКэшПартий(Контрагент, Цель, Неизв)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ГруппаФинансовогоУчета, Контрагент, НалоговоеНазначение, СтавкаНДС, ВидЦенности, КодСтроки, КлючАналитики
	|ИЗ РегистрСведений.АналитикаУчетаПартий
	|ГДЕ Контрагент = &К И Поставщик = &P";
	Запрос.УстановитьПараметр("К", Контрагент);
	Запрос.УстановитьПараметр("P", Неизв);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Изм = Новый Структура("ГруппаФинансовогоУчета,Контрагент,НалоговоеНазначение,СтавкаНДС,ВидЦенности,КодСтроки",
			Выб.ГруппаФинансовогоУчета, Выб.Контрагент, Выб.НалоговоеНазначение, Выб.СтавкаНДС, Выб.ВидЦенности, Выб.КодСтроки);
		КанонКлюч = НайтиКлючПоИзмерениям("Справочник.КлючиАналитикиУчетаПартий", "Поставщик", Цель, Изм);
		Если НЕ ЗначениеЗаполнено(КанонКлюч) Тогда
			КанонКлюч = Выб.КлючАналитики;
		КонецЕсли;

		Нов = РегистрыСведений.АналитикаУчетаПартий.СоздатьМенеджерЗаписи();
		Нов.Поставщик = Цель;
		Нов.ГруппаФинансовогоУчета = Выб.ГруппаФинансовогоУчета;
		Нов.Контрагент = Выб.Контрагент;
		Нов.НалоговоеНазначение = Выб.НалоговоеНазначение;
		Нов.СтавкаНДС = Выб.СтавкаНДС;
		Нов.ВидЦенности = Выб.ВидЦенности;
		Нов.КодСтроки = Выб.КодСтроки;
		Нов.КлючАналитики = КанонКлюч;
		Нов.Записать();

		Стар = РегистрыСведений.АналитикаУчетаПартий.СоздатьМенеджерЗаписи();
		Стар.Поставщик = Неизв;
		Стар.ГруппаФинансовогоУчета = Выб.ГруппаФинансовогоУчета;
		Стар.Контрагент = Выб.Контрагент;
		Стар.НалоговоеНазначение = Выб.НалоговоеНазначение;
		Стар.СтавкаНДС = Выб.СтавкаНДС;
		Стар.ВидЦенности = Выб.ВидЦенности;
		Стар.КодСтроки = Выб.КодСтроки;
		Стар.Удалить();
	КонецЦикла;

КонецПроцедуры

// Документы: правит поле Партнер в шапке и во всех ТЧ-строках, где Партнер = Неизв
// (контекст контрагента — по шапке Контрагент или по строке).
&НаСервере
Процедура ОбработатьДокументы(Контрагент, Цель, Неизв)

	СписокТипов = "ЗаказПоставщику,ЗаявкаНаРасходованиеДенежныхСредств,СписаниеБезналичныхДенежныхСредств,"
		+ "ПоступлениеБезналичныхДенежныхСредств,ПриобретениеТоваровУслуг,АктВыполненныхРабот,ЗаказКлиента";

	Для Каждого ТипДок Из СтрРазделить(СписокТипов, ",") Цикл
		ИмяДок = СокрЛП(ТипДок);
		МетаДок = Метаданные.Документы.Найти(ИмяДок);
		Если МетаДок = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка КАК Ссылка ИЗ Документ." + ИмяДок
			+ " ГДЕ Контрагент = &К И Партнер = &P";
		Запрос.УстановитьПараметр("К", Контрагент);
		Запрос.УстановитьПараметр("P", Неизв);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			ДокОбъект = Выб.Ссылка.ПолучитьОбъект();
			Изменён = ЗаменитьПартнераВОбъекте(ДокОбъект, МетаДок, Неизв, Цель);
			Если Изменён Тогда
				ЗаписатьЗагрузкой(ДокОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Универсально заменяет Неизв->Цель во всех реквизитах/ТЧ типа Партнеры у объекта.
&НаСервере
Функция ЗаменитьПартнераВОбъекте(Объект, МетаОбъекта, Неизв, Цель)

	ТипП = Тип("СправочникСсылка.Партнеры");
	Изменён = Ложь;

	Для Каждого Рекв Из МетаОбъекта.Реквизиты Цикл
		Если Рекв.Тип.СодержитТип(ТипП) Тогда
			Если Объект[Рекв.Имя] = Неизв Тогда
				Объект[Рекв.Имя] = Цель;
				Изменён = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для Каждого ТЧ Из МетаОбъекта.ТабличныеЧасти Цикл
		Для Каждого Рекв Из ТЧ.Реквизиты Цикл
			Если Рекв.Тип.СодержитТип(ТипП) Тогда
				Для Каждого СтрТЧ Из Объект[ТЧ.Имя] Цикл
					Если СтрТЧ[Рекв.Имя] = Неизв Тогда
						СтрТЧ[Рекв.Имя] = Цель;
						Изменён = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Изменён;

КонецФункции

#КонецОбласти

#Область Служебные

&НаСервере
Функция ВыбратьСсылки(ИмяТаблицы, Поле1, Знач1, Поле2, Знач2)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка ИЗ " + ИмяТаблицы + " КАК Т ГДЕ Т." + Поле1
		+ " = &З1 И Т." + Поле2 + " = &З2 И НЕ Т.ПометкаУдаления";
	Запрос.УстановитьПараметр("З1", Знач1);
	Запрос.УстановитьПараметр("З2", Знач2);
	Результат = Новый Массив;
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Результат.Добавить(Выб.Ссылка);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаменитьИПометить(СтарыйРеф, Эталон)
	Соотв = Новый Соответствие;
	Соотв.Вставить(СтарыйРеф, Эталон);
	Парам = ОбщегоНазначения.ПараметрыЗаменыСсылок();
	Парам.СпособУдаления = "Пометить";
	Парам.ВключатьБизнесЛогику = Ложь;
	ОбщегоНазначения.ЗаменитьСсылки(Соотв, Парам);
	// ЗаменитьСсылки не помечает уже-сироту — помечаем явно
	Объ = СтарыйРеф.ПолучитьОбъект();
	Объ.ПометкаУдаления = Истина;
	ЗаписатьЗагрузкой(Объ);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗагрузкой(Объект)
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
КонецПроцедуры

// Сколько НЕпомеченных ссылок Неизвестного осталось у контрагента (гейт).
&НаСервере
Функция ОстатокПоКонтрагенту(Контрагент, Неизв)
	Итог = 0;
	Итог = Итог + СчётСсылок("Справочник.КлючиАналитикиУчетаПоПартнерам", "Партнер", Контрагент, Неизв, Истина);
	Итог = Итог + СчётСсылок("Справочник.ОбъектыРасчетов", "Партнер", Контрагент, Неизв, Истина);
	Итог = Итог + СчётСсылок("Справочник.ДоговорыКонтрагентов", "Партнер", Контрагент, Неизв, Истина);
	Итог = Итог + СчётСсылок("РегистрСведений.АналитикаУчетаПоПартнерам", "Партнер", Контрагент, Неизв, Ложь);
	Итог = Итог + СчётСсылок("Справочник.КлючиАналитикиУчетаПартий", "Поставщик", Контрагент, Неизв, Истина);
	Итог = Итог + СчётСсылок("РегистрСведений.АналитикаУчетаПартий", "Поставщик", Контрагент, Неизв, Ложь);
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер") = Неизв Тогда
		Итог = Итог + 1;
	КонецЕсли;
	Возврат Итог;
КонецФункции

&НаСервере
Функция СчётСсылок(ИмяТаблицы, Поле, Контрагент, Неизв, ЕстьПометка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Кол ИЗ " + ИмяТаблицы + " КАК Т ГДЕ Т.Контрагент = &К И Т."
		+ Поле + " = &P" + ?(ЕстьПометка, " И НЕ Т.ПометкаУдаления", "");
	Запрос.УстановитьПараметр("К", Контрагент);
	Запрос.УстановитьПараметр("P", Неизв);
	Выб = Запрос.Выполнить().Выбрать();
	Возврат ?(Выб.Следующий(), Выб.Кол, 0);
КонецФункции

// Резолвер реального партнёра (самодостаточная копия А_Привилегированный.ОбеспечитьРеальногоПартнераПоКонтрагенту).
&НаСервере
Функция ОбеспечитьРеальногоПартнераПоКонтрагенту(КонтрагентСсылка, Создавать = Истина)

	Неизв = Справочники.Партнеры.НеизвестныйПартнер;
	Если НЕ ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		Возврат ?(Создавать, Неизв, Справочники.Партнеры.ПустаяСсылка());
	КонецЕсли;

	Рек = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КонтрагентСсылка,
		"Наименование,НаименованиеПолное,ЮрФизЛицо,КодПоЕДРПОУ,НалоговыйНомер,ГоловнойКонтрагент,Партнер");

	Если ЭтоРеальныйПартнер(Рек.Партнер, Неизв) Тогда
		Возврат Рек.Партнер;
	КонецЕсли;

	Если ЗначениеЗаполнено(Рек.ГоловнойКонтрагент) Тогда
		ПартнерГол = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рек.ГоловнойКонтрагент, "Партнер");
		Если ЭтоРеальныйПартнер(ПартнерГол, Неизв) Тогда
			Возврат ПартнерГол;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Рек.Наименование) Тогда
		Тезка = Справочники.Партнеры.НайтиПоНаименованию(Рек.Наименование, Истина);
		Если ЭтоРеальныйПартнер(Тезка, Неизв) Тогда
			Возврат Тезка;
		КонецЕсли;
	КонецЕсли;

	Кандидат = НайтиПартнераПоНалоговым(КонтрагентСсылка, Рек, Неизв);
	Если ЭтоРеальныйПартнер(Кандидат, Неизв) Тогда
		Возврат Кандидат;
	КонецЕсли;

	Если НЕ Создавать Тогда
		Возврат Справочники.Партнеры.ПустаяСсылка();
	КонецЕсли;

	НовыйПартнер = Справочники.Партнеры.СоздатьЭлемент();
	НовыйПартнер.Наименование = Рек.Наименование;
	НовыйПартнер.НаименованиеПолное = ?(ЗначениеЗаполнено(Рек.НаименованиеПолное), Рек.НаименованиеПолное, Рек.Наименование);
	Если Рек.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		ИЛИ Рек.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		НовыйПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
	Иначе
		НовыйПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
	КонецЕсли;
	НовыйПартнер.Клиент = Истина;
	НовыйПартнер.Поставщик = Истина;
	НовыйПартнер.ПрочиеОтношения = Истина;
	НовыйПартнер.Записать();
	Возврат НовыйПартнер.Ссылка;

КонецФункции

&НаСервере
Функция ЭтоРеальныйПартнер(Партнер, Неизв)
	Возврат ЗначениеЗаполнено(Партнер) И Партнер <> Неизв
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "ПометкаУдаления");
КонецФункции

&НаСервере
Функция НайтиПартнераПоНалоговым(КонтрагентСсылка, Рек, Неизв)
	Если НЕ ЗначениеЗаполнено(Рек.КодПоЕДРПОУ) И НЕ ЗначениеЗаполнено(Рек.НалоговыйНомер) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 К.Партнер КАК Партнер ИЗ Справочник.Контрагенты КАК К
	|ГДЕ К.Ссылка <> &Контрагент И К.Партнер <> &Неизв И НЕ К.Партнер.ПометкаУдаления
	|	И ((К.КодПоЕДРПОУ = &ЕДРПОУ И &ЕстьЕДРПОУ) ИЛИ (К.НалоговыйНомер = &НН И &ЕстьНН))";
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Запрос.УстановитьПараметр("Неизв", Неизв);
	Запрос.УстановитьПараметр("ЕДРПОУ", Рек.КодПоЕДРПОУ);
	Запрос.УстановитьПараметр("ЕстьЕДРПОУ", ЗначениеЗаполнено(Рек.КодПоЕДРПОУ));
	Запрос.УстановитьПараметр("НН", Рек.НалоговыйНомер);
	Запрос.УстановитьПараметр("ЕстьНН", ЗначениеЗаполнено(Рек.НалоговыйНомер));
	Выб = Запрос.Выполнить().Выбрать();
	Возврат ?(Выб.Следующий(), Выб.Партнер, Неопределено);
КонецФункции

#КонецОбласти
